## Intro to Pandas
* Importing data
* Data Structures
* Operations for manipulating numericla tables and time series.

In [1]:
import pandas as pd
import numpy as np

## Series

A Series is a one-dimensional labeled array. What this mean is that we can now access (index) elements in this array using some assigned labels. We create a Series using **pd.Series(data, index)**, where data is our array and index is the corresponding labels. <br>
Lets see an example below:

In [9]:
my_series = pd.Series(data = [1,2,3], index = ['A', 'B', 'C'])
print(my_series)
print(type(my_series))

A    1
B    2
C    3
dtype: int64
<class 'pandas.core.series.Series'>

In [5]:
my_series2 = pd.Series(data = [10,20,30], index = ["Apple", "Bluberry", "Carrots"])
print(my_series2)
print(type(my_series2))

Apple       10
Bluberry    20
Carrots     30
dtype: int64
<class 'pandas.core.series.Series'>

In [7]:
my_series3 = pd.Series(data = [.50, .75, 1.15], index = ["blueberry muffin", "carrot cake", "pumpkin spice loaf"])
print(my_series3)
print(type(my_series3))

blueberry muffin      0.50
carrot cake           0.75
pumpkin spice loaf    1.15
dtype: float64
<class 'pandas.core.series.Series'>

Since **my_series** is of type Series, we can now access the first element in the array in two ways. The ususal way we access array elements: **my_series[0]**, and an additional way using the index labels we assigned: **my_series['A']**. Try accessing all of the arrays elements using borht methods. See the example below.

In [14]:
print(f"Accessing first element using my_series[0]: {my_series[0]}")
print(f"Accessing first element using my_series['A']: {my_series['A']}")

Accessing first element using my_series[0]: 1
Accessing first element using my_series['A']: 1

/var/folders/23/j9wjdnd957q0xnpzv2x0w7s80000gn/T/ipykernel_4687/2994388138.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(f"Accessing first element using my_series[0]: {my_series[0]}")

In [16]:
print(f"Accessing first element using my_series[0]: {my_series[0]}")
print(f"Accessing first element using my_series['A']: {my_series['A']}")

Accessing first element using my_series[0]: 1
Accessing first element using my_series['A']: 1

/var/folders/23/j9wjdnd957q0xnpzv2x0w7s80000gn/T/ipykernel_4687/2994388138.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(f"Accessing first element using my_series[0]: {my_series[0]}")

Note that **data*** can passed as: 
* A Python list (like we saw above) 
* A NumPy array 
* A Python dictionary

Here's an example of how we would a dictionary to **data**. Since dictionarys already come with key value paris, there's no need for us to pass index labels.

In [17]:
my_series = pd.Series(data = {'A': 1, 'B': 2, 'C': 3})
print(my_series)
print(type(my_series))

A    1
B    2
C    3
dtype: int64
<class 'pandas.core.series.Series'>

And here's a Numpy array example:

In [19]:
my_series = pd.Series(data = np.array([1, 2, 3]), index = ['A', 'B', 'C'])
print(my_series)
print(type(my_series))

A    1
B    2
C    3
dtype: int64
<class 'pandas.core.series.Series'>

**Note: if index labels are not specified for a Series, they will default to [0,n) where n is the number of data values we have. 
<br>
For example:**

In [20]:
my_series = pd.Series(pd.Series(data = [10, 20, 30]))
print(my_series)
print(type(my_series))

0    10
1    20
2    30
dtype: int64
<class 'pandas.core.series.Series'>

What's really cool about Series is that we can perform operations on them, which will be done based off of the index. For example, let's say that I have two Series: **week_one** and **week_two**, both representing how much money I owe my employees for each week.

In [21]:
week_one = pd.Series(data = [100, 50, 300], index = ['Bob', 'Sally', 'Jess'])
week_one

Bob      100
Sally     50
Jess     300
dtype: int64

In [22]:
week_two = pd.Series(data = [500, 30, 20], index = ['Bob', 'Sally', 'Jess'])
week_two

Bob      500
Sally     30
Jess      20
dtype: int64

In [23]:
week_three = pd.Series(data = [10, 20, 30], index = ['Wednesday', 'Gomez', 'Morticia'])
week_three

Wednesday    10
Gomez        20
Morticia     30
dtype: int64

We can then sum these two Series together to get a new Series **total_due** representing the total amountthat we owe each person for the two weeks.

In [24]:
total_due = week_one + week_two
total_due

Bob      600
Sally     80
Jess     320
dtype: int64

What if we try adding different size Series?

In [29]:
week_four = pd.Series(data = [100, 200, 300, 400], index = ['Sally', 'Jack', 'Zero', 'Victor'])
week_four

Sally     100
Jack      200
Zero      300
Victor    400
dtype: int64

In [30]:
new_total_due = week_three + week_four
new_total_due

Gomez       NaN
Jack        NaN
Morticia    NaN
Sally       NaN
Victor      NaN
Wednesday   NaN
Zero        NaN
dtype: float64

In [33]:
week_five = pd.Series(data = [10, 20, 30, 40], index = ['Ally', 'Bob', 'Coleen', 'Don'])
week_five

Ally      10
Bob       20
Coleen    30
Don       40
dtype: int64

In [34]:
week_six = pd.Series(data = [30, 40, 50], index = ['Ally', 'Bob', 'Coleen'] )
week_six

Ally      30
Bob       40
Coleen    50
dtype: int64

In [35]:
new_total_due_2 = week_five + week_six
new_total_due_2

Ally      40.0
Bob       60.0
Coleen    80.0
Don        NaN
dtype: float64

Notice how the operator (+ in this case) was applied along the corresponding labels.

Awesome! Let's now move on to talk about pandas DataFrames, which builds off of the Series and is what we'll be using most throughtout the course.
<br>

## DataFrames

Formally, a DataFrame is 2-dimensional labeled data structure with columns of potentially different types. It's probably easiest to think of DataFrames as many Series placed next to each other to share a common index label, but you can also think of them as spreadsheets, SQL tables, or a dictionary of Series objects.

We create a DataFrame using **pd.DataFrame(data, index, columns).data** and **index** are pretty familiar to us now that we've seen Series, but what is this new **columns** parameter? Well, if you think of DataFramesare many Series placed next to each other to share a common index label, we need some way of accessing each individual Series, This is where **columns** come in. You can think of it as additional labels for each individual Series/column. Let's see an example below.

In [38]:
my_df = pd.DataFrame(data = np.arange(0,20).reshape(4,5), index = ['A', 'B', 'C', 'D'], 
                     columns = ['col1', 'col2', 'col3', 'col4', 'col5'])

print(my_df)
print(type(my_df))

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14
D    15    16    17    18    19
<class 'pandas.core.frame.DataFrame'>

Notice the type of what's returned when we access 'col2'. A Series 😲�, which shouldn't come as too much of a surprise since we mentioned that DataFrames can be thought of as these individula Series placed next to each other to share a common index label.

In [94]:
print(my_df['col2'])
print(type(my_df['col2']))

A     1
B     6
C    11
D    16
Name: col2, dtype: int64
<class 'pandas.core.series.Series'>

In [95]:
print(my_df['col4'])
print(type(my_df['col4']))

A     3
B     8
C    13
D    18
Name: col4, dtype: int64
<class 'pandas.core.series.Series'>

In [96]:
print(my_df['col4'])
print(type('col4')) # interesting a col by itself is considered a 'str' type 🧐

A     3
B     8
C    13
D    18
Name: col4, dtype: int64
<class 'str'>

**Note: As mentioned in the Series section, DataFrame index labels will also default to [0, n) if not specified. For example:**

In [97]:
my_df = pd.DataFrame(data=np.arange(0,20).reshape(4,5), columns=['col1','col2','col3','col4','col5']) 
my_df

   col1  col2  col3  col4  col5
0     0     1     2     3     4
1     5     6     7     8     9
2    10    11    12    13    14
3    15    16    17    18    19

Also, DataFrames will display a lot nicer in jupyter notebooks if you don't call print() on them. 😊

Let's now see how we can access data from these DataFrames.

## DataFrames: Selection

In [100]:
my_df = pd.DataFrame(data = np.arange(0, 20).reshape(4, 5), index = ['A', 'B', 'C', 'D'],
                        columns = ['col1', 'col2', 'col3', 'col4', 'col5'])
my_df

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14
D    15    16    17    18    19

We can access individual columsn using the column names/labels we specified.

In [101]:
my_df['col2']

A     1
B     6
C    11
D    16
Name: col2, dtype: int64

We can access multiple columns by specifying a list of the column names that we'd like to retrieve.

In [102]:
my_df[['col2', 'col3']]

   col2  col3
A     1     2
B     6     7
C    11    12
D    16    17

In [103]:
my_df[['col3', 'col5']]

   col3  col5
A     2     4
B     7     9
C    12    14
D    17    19

What if we'd like to access row information? We can specify the index location using **.iloc**, or the index name/label using **.loc**

In [104]:
my_df.iloc[0] # this will return row 0 in vertical format!

col1    0
col2    1
col3    2
col4    3
col5    4
Name: A, dtype: int64

In [105]:
my_df.iloc[2]

col1    10
col2    11
col3    12
col4    13
col5    14
Name: C, dtype: int64

In [106]:
my_df.iloc[3]

col1    15
col2    16
col3    17
col4    18
col5    19
Name: D, dtype: int64

In [107]:
my_df.loc['A']

col1    0
col2    1
col3    2
col4    3
col5    4
Name: A, dtype: int64

In [108]:
my_df.loc['C']

col1    10
col2    11
col3    12
col4    13
col5    14
Name: C, dtype: int64

We can grab a section using **[start_index:stop_index]**. stop_index is not inclusive when using index locations. This should look familiar to how we accessed elements in Numpy arrays.

In [109]:
my_df.iloc[0:3]

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14

In [110]:
my_df.loc['A':'C']

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14

In [111]:
my_df.iloc[1:3]

   col1  col2  col3  col4  col5
B     5     6     7     8     9
C    10    11    12    13    14

In [112]:
my_df.loc['B': 'D']

   col1  col2  col3  col4  col5
B     5     6     7     8     9
C    10    11    12    13    14
D    15    16    17    18    19

For a section of both rows and columns, we must specify both the row sections of interest and columns sections of interest. This should also look familar to how we accessed row and column sections of interest from 2d Numpy arrays, except we now have to use **.iloc** or **.loc** depending on how we'd like to specify the rows (by index position or index label/name)

In [113]:
my_df.iloc[1:4, 0:3] # [rows, cols]

   col1  col2  col3
B     5     6     7
C    10    11    12
D    15    16    17

In [114]:
my_df.iloc[2:4, 0:3]

   col1  col2  col3
C    10    11    12
D    15    16    17

In [115]:
my_df.loc['B':'D', 'col1':'col3']

   col1  col2  col3
B     5     6     7
C    10    11    12
D    15    16    17

Recall how we were able to select elements from a Numpy array based off of some condition. The same can be done with DataFrames since our data is essentially just a Numpy array. Let's see a quick example.

In [116]:
my_df = pd.DataFrame(data = np.arange(0,20).reshape(4,5), index = ['A', 'B', 'C', 'D'], 
                        columns = ['col1', 'col2', 'col3', 'col4', 'col5'])
my_df

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14
D    15    16    17    18    19

Using comparison operators with our DataFrame, we get back a DataFrame with True/False values indicating whether the value at that position satisfoed the condition.

In [117]:
my_df%2 == 0 # this will return true for all even entry!

    col1   col2   col3   col4   col5
A   True  False   True  False   True
B  False   True  False   True  False
C   True  False   True  False   True
D  False   True  False   True  False

So as we saw with Numpy arrays, we can specify this condition as what we would like to select. We'll then get back only the values that met the condition. Those that did not meet the condition will get replaced with NaN representing a missing or empty value.

In [118]:
my_df[my_df % 2 == 0]

   col1  col2  col3  col4  col5
A   0.0   NaN   2.0   NaN   4.0
B   NaN   6.0   NaN   8.0   NaN
C  10.0   NaN  12.0   NaN  14.0
D   NaN  16.0   NaN  18.0   NaN

We'll late learn how to properly take care of these NaN values, but we can fill them all  with a certain value using fillna(value). For example:

In [119]:
# filling all NaN values with 0 
my_df[my_df % 2 == 0].fillna(value=0) # notice the .fillna(value)

   col1  col2  col3  col4  col5
A   0.0   0.0   2.0   0.0   4.0
B   0.0   6.0   0.0   8.0   0.0
C  10.0   0.0  12.0   0.0  14.0
D   0.0  16.0   0.0  18.0   0.0

In [120]:
# filling all NaN values with whatever the mean of my_df's original col2 is: (1+6+11+16)/4 = 8.5
my_df[my_df % 2 == 0].fillna(value = my_df['col2'].mean())

   col1  col2  col3  col4  col5
A   0.0   8.5   2.0   8.5   4.0
B   8.5   6.0   8.5   8.0   8.5
C  10.0   8.5  12.0   8.5  14.0
D   8.5  16.0   8.5  18.0   8.5

### DataFrames: Adding and Dropping Columns

In [121]:
my_df

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14
D    15    16    17    18    19

We can create new columns in DataFrame by either passing in the new data we would like to store there, or from existing columns/features in our DataFrame. Let's see an example of noth cases below.

In [133]:
my_df['newCol'] = [10, 20, 30, 40]
my_df

   col1  col2  col3  col4  col5  col1+col2  col2 plus col4  newCol
A     0     1     2     3     4          1               4      10
B     5     6     7     8     9         11              14      20
C    10    11    12    13    14         21              24      30
D    15    16    17    18    19         31              34      40

In [134]:
my_df['col1+col2'] = my_df['col1'] + my_df['col2'] # adds the vals from r1 and r2 and assigns them to a new col
my_df

   col1  col2  col3  col4  col5  col1+col2  col2 plus col4  newCol
A     0     1     2     3     4          1               4      10
B     5     6     7     8     9         11              14      20
C    10    11    12    13    14         21              24      30
D    15    16    17    18    19         31              34      40

In [135]:
my_df['col2 plus col4'] = my_df['col2'] + my_df['col4']
my_df

   col1  col2  col3  col4  col5  col1+col2  col2 plus col4  newCol
A     0     1     2     3     4          1               4      10
B     5     6     7     8     9         11              14      20
C    10    11    12    13    14         21              24      30
D    15    16    17    18    19         31              34      40

In [136]:
my_df['new new col'] = [100, 200, 300, 400]
my_df

,col1,col2,col3,col4,col5,col1+col2,col2 plus col4,newCol,new new col
A,0,1,2,3,4,1,4,10,100
B,5,6,7,8,9,11,14,20,200
C,10,11,12,13,14,21,24,30,300
D,15,16,17,18,19,31,34,40,400

What if we want to drop/remove certain column(s)? We can acomplish this using **drop(columns).**

In [137]:
my_df.drop(columns = ['newCol'])

   col1  col2  col3  col4  col5  col1+col2  col2 plus col4  new new col
A     0     1     2     3     4          1               4          100
B     5     6     7     8     9         11              14          200
C    10    11    12    13    14         21              24          300
D    15    16    17    18    19         31              34          400

In [138]:
my_df.drop(columns = ['new new col'])

   col1  col2  col3  col4  col5  col1+col2  col2 plus col4  newCol
A     0     1     2     3     4          1               4      10
B     5     6     7     8     9         11              14      20
C    10    11    12    13    14         21              24      30
D    15    16    17    18    19         31              34      40

Note that these changes are not done inplace. This means that these changes are not pemanent. We can see this if we print my_df again.

In [139]:
my_df

,col1,col2,col3,col4,col5,col1+col2,col2 plus col4,newCol,new new col
A,0,1,2,3,4,1,4,10,100
B,5,6,7,8,9,11,14,20,200
C,10,11,12,13,14,21,24,30,300
D,15,16,17,18,19,31,34,40,400

To make these changes permanent, we can supply an additional parameter **inplace = True**

In [140]:
my_df.drop(columns = ['newCol', 'new new col'], inplace = True)

Now if we print my_df again we can see that the changes were saved. Keep this in mind when you want to modify the original DataFrame.

In [141]:
my_df

   col1  col2  col3  col4  col5  col1+col2  col2 plus col4
A     0     1     2     3     4          1               4
B     5     6     7     8     9         11              14
C    10    11    12    13    14         21              24
D    15    16    17    18    19         31              34

## DataFrames: Groupby and Common Operations

In [145]:
my_df = pd.DataFrame({'Type': ['Falcon','Falcon','Parrot','Parrot','Cat','Cat','Cat'],
                      'Max Speed': [380., 370., 24., 26., 50., 50., 150.]})
my_df

     Type  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0
4     Cat       50.0
5     Cat       50.0
6     Cat      150.0

We'll use this small DataFrame to demonstrate some common operations and useful functions that we can perform on DataFrames.**my_df** has 7 observations (0-6) of animals. For each animal, we recorded the type of animal that they are, and their max speed.

Something we'll often like to know is how many unique values are in a certain column. We can achieve this by calling **unique()** on our column of interest.

In [147]:
print(f"unique types: {my_df['Type'].unique()}")
print(f"unique max speeds: {my_df['Max Speed'].unique()}")

unique types: ['Falcon' 'Parrot' 'Cat']
unique max speeds: [380. 370.  24.  26.  50. 150.]

What if we'd like to also know how many of each unique type there are? This can be done by instead calling **value_counts()**. This will not only tell us how many unique values there are in the column(cat, parrot, and falcon in this case), but also how many of that type we have(3 cats, 2 parrots, and 2 falcons in the this DataFrame).

In [148]:
my_df['Type'].value_counts()

Type
Cat       3
Falcon    2
Parrot    2
Name: count, dtype: int64

We can also do things like get the sum, mean, min, or max of a column:

In [150]:
print(f"sum of Max Speed col: {my_df['Max Speed'].sum()}")
print(f"sum of Max Speed col: {my_df['Max Speed'].mean()}")
print(f"sum of Max Speed col: {my_df['Max Speed'].min()}")
print(f"sum of Max Speed col: {my_df['Max Speed'].max()}")

sum of Max Speed col: 1050.0
sum of Max Speed col: 150.0
sum of Max Speed col: 24.0
sum of Max Speed col: 380.0

What if we wanted to know the mean Max Speed for each group of animals? This is where a function called **groupby(by)** will come in handy. This will group all common types and the allow us to apply a function like mean to each group. For example:

In [151]:
# This grouped all cats together, all falcons together, all parrots together and then applied the mean function
# to each groups columns (only Max Speed in this case). So we can see that the mean Max Speed for all cats is 
# DataFrame is 83.33333.
my_df.groupby(by='Type').mean()

         Max Speed
Type
Cat      83.333333
Falcon  375.000000
Parrot   25.000000